
// Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9] чрез прилагане на следните правила:
  // -  Ако точките са между 1 и 3, програмата ги умножава по 10.
  // -  Ако точките са между 4 и 6, ги умножава по 100.
  // -  Ако точките са между 7 и 9, ги умножава по 1000.
  // -  Ако точките са 0 или повече от 9, се отпечатва съобщение за грешка.



using System;


namespace Zad._10
{
    class Program
    {
        static void Main()
        {
            Console.Write(" Въведете вашия брой точки: ");
            int n = int.Parse(Console.ReadLine());
            switch(n)
            {
                case 1:
                case 2:
                case 3:
                    Console.WriteLine(" Точките ви ще се умножат по 10. Вие имате {0}т.",n*10);
                    break;
                case 4:
                case 5:
                case 6:
                    Console.WriteLine(" Точките ви ще се умножат по 100. Вие имате {0}т.", n * 100);
                    break;
                case 7:
                case 8:
                case 9:
                    Console.WriteLine(" Точките ви ще се умножат по 1000. Вие имате {0}т.", n * 1000);
                    break;
                default: Console.WriteLine(" Невалиден брой точки !");
                    break;
            }
        }
    }
}
